app/controllers/courses_controller.rb

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def show
    @course = Course.find(params[:id])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 1 LIMIT 1
---
  def edit
		@i=1
    @course = Course.find(params[:id])

INSERT INTO `courses` (`state`, `holes`, `user_id`, `name`, `created_at`, `country`, `city`, `updated_at`, `par`, `club`) VALUES ('', NULL, 1, 'BG Stadium', '2011-02-28 09:37:39', 'India', '', '2011-02-28 09:37:39', NULL, 'Bangalore Golf')
---
  def create
    @course = Course.new(params[:course])
    @course.user_id = self.current_user
    respond_to do |format|
      if @course.save

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 16 LIMIT 1
SELECT `course_holes`.* FROM `course_holes` WHERE `course_holes`.`id` IN (80, 81, 82, 83, 84, 85, 86, 87, 88) AND (`course_holes`.course_id = 16)
UPDATE `course_holes` SET `mens_hcp` = 8, `ladies_hcp` = 12, `updated_at` = '2011-02-18 10:57:36' WHERE `course_holes`.`id` = 81
UPDATE `courses` SET `name` = 'Rakesh', `club` = 'Mac Club', `updated_at` = '2011-02-18 10:53:23' WHERE `courses`.`id` = 16
---
  def update
		@course = Course.find(params[:id])
		new_value = {:name => params[:course][:name],:par => params[:course][:par],:club => params[:course][:club],:holes => params[:course][:holes]}
		new_value.merge({:country_id => params[:course][:country_id] }) if params[:course][:country_id]
		new_value.merge({:state_id => params[:course][:state_id]}) if params[:course][:state_id]
		new_value.merge({:city_id => params[:course][:city_id]}) if params[:course][:city_id]

		@course.course_holes.each do |ch|
			ch.update_attributes(params[:course][:course_holes_attributes][ch.name.to_sym])

SELECT `courses`.* FROM `courses` WHERE `courses`.`id` = 3 LIMIT 1
DELETE FROM `courses` WHERE `courses`.`id` = 3
---
  def destroy
    @course = Course.find(params[:id])
    @course.destroy