app/controllers/groups_controller.rb

SELECT `groups`.* FROM `groups`
---
  def index

	 @course = params[:course_id] if params[:course_id]
   @groups = Group.all

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def show
    @group = Group.find(params[:id])
    @users = User.find(:all)

SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def new

    @group = Group.new
    @users = User.find(:all)

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
---
  def edit
    @group = Group.find(params[:id])
    @users = User.find(:all)

INSERT INTO `groups` (`created_at`, `name`, `user_id`, `updated_at`) VALUES ('2011-02-25 11:37:29', 'My Group', 1, '2011-02-25 11:37:29')
---
  def create
    @group = Group.new(params[:group])
    @group.user_id = self.current_user
		respond_to do |format|
      if @group.save

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 3 LIMIT 1
---
  def update
    @group = Group.find(params[:id])

SELECT `groups`.* FROM `groups` WHERE `groups`.`id` = 1 LIMIT 1
SELECT `games`.* FROM `games` WHERE `games`.`id` = 29 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
UPDATE `games` SET `updated_at` = '2011-02-21 07:55:03', `group_id` = 1 WHERE `games`.`id` = 30
---
  def add_group_to_game
    @group = Group.find(params[:id])
    @game = Game.new
		@game.course_id= params[:course_id]
    @game.group_id = @group.id
    @game.user_id = self.current_user.id
		@game.status = 1
    @game.save
    @get_players = Group.find(@game.group_id).users
    @get_course  = Course.find(@game.course_id).course_holes
		@get_players.each do |gp|
      @get_course.each do |gc|
        @score = Score.find_by_game_id_and_course_hole_id_and_user_id(@game.id,gc.id,gp.id) || Score.new
        @score.user_id = gp.id
        @score.course_hole_id = gc.id
        @score.game_id = @game.id
        @score.score =  0
        @score.save