app/controllers/scores_controller.rb

  def show
    @score = Score.find(params[:id])
---
SELECT `scores`.* FROM `scores` WHERE `scores`.`id` = 1 LIMIT 1

  def create
    @get_players.each do |gp|
      @get_course.each do |gc|
        @score = Score.find_by_game_id_and_course_hole_id_and_user_id(params[:game_id],gc.id,gp.id) || Score.new
        @score.user_id = gp.id
        @score.course_hole_id = gc.id
        @score.game_id = @selected_game.id
        @score.score = params[:score][gp.id.to_s.to_sym][gc.id.to_s.to_sym][0] ? params[:score][gp.id.to_s.to_sym][gc.id.to_s.to_sym][0] : 0
        @score.save
---
SELECT `course_holes`.* FROM `course_holes` WHERE (`course_holes`.course_id = 2)
SELECT `scores`.* FROM `scores` WHERE `scores`.`course_hole_id` = 10 AND `scores`.`user_id` = 1 AND `scores`.`game_id` = 43 LIMIT 1
INSERT INTO `scores` (`updated_at`, `created_at`, `course_hole_id`, `game_id`, `score`, `user_id`) VALUES ('2011-02-21 10:42:32', '2011-02-21 10:42:32', NULL, NULL, NULL, NULL)
UPDATE `scores` SET `user_id` = 2, `course_hole_id` = 10, `updated_at` = '2011-02-21 13:09:06', `score` = 5 WHERE `scores`.`id` = 77