app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`updated_at`, `created_at`, `crypted_password`, `salt`, `login`, `remember_token`, `remember_token_expires_at`, `email`, `name`) VALUES ('2011-02-18 13:08:31', '2011-02-18 13:08:31', '71a707bbab6f3520442bd6952b91c19f99ccd0ee', '8cd5c604f92b9cb33017a90189308342a596c991', 'rakesh', NULL, NULL, 'rakesh.shetty@exilant.com', '')